# Вычислить число c заданной точностью d



# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$

# from math import pi

# d =  int(input("Введите число для заданной точности числа Пи:\n"))
# print(f'число Пи с заданной точностью {d} равно {round(pi, d)}')
id = ["id1", "id2", "id3"]
d = list(enumerate(id=id + ))
print(d)
